load-test-results/hey-cached-20260425-130215.txt

Summary:
  Total:	0.0573 secs
  Slowest:	0.0143 secs
  Fastest:	0.0001 secs
  Average:	0.0025 secs
  Requests/sec:	17438.6282
  
  Total data:	69320 bytes
  Size/request:	69 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [471]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.003 [225]	|■■■■■■■■■■■■■■■■■■■
  0.004 [90]	|■■■■■■■■
  0.006 [75]	|■■■■■■
  0.007 [70]	|■■■■■■
  0.009 [20]	|■■
  0.010 [35]	|■■■
  0.011 [10]	|■
  0.013 [1]	|
  0.014 [2]	|


Latency distribution:
  10%% in 0.0002 secs
  25%% in 0.0004 secs
  50%% in 0.0016 secs
  75%% in 0.0040 secs
  90%% in 0.0067 secs
  95%% in 0.0083 secs
  99%% in 0.0109 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0061 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0044 secs
  req write:	0.0002 secs, 0.0000 secs, 0.0051 secs
  resp wait:	0.0012 secs, 0.0000 secs, 0.0098 secs
  resp read:	0.0008 secs, 0.0000 secs, 0.0118 secs

Status code distribution:
  [200]	60 responses
  [429]	940 responses