load-test-results/hey-cached-20260425-131303.txt

Summary:
  Total:	0.3549 secs
  Slowest:	0.1335 secs
  Fastest:	0.0001 secs
  Average:	0.0162 secs
  Requests/sec:	2817.9127
  
  Total data:	69320 bytes
  Size/request:	69 bytes

Response time histogram:
  0.000 [1]	|
  0.013 [637]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.027 [131]	|■■■■■■■■
  0.040 [79]	|■■■■■
  0.053 [78]	|■■■■■
  0.067 [23]	|■
  0.080 [35]	|■■
  0.093 [3]	|
  0.107 [0]	|
  0.120 [4]	|
  0.134 [9]	|■


Latency distribution:
  10%% in 0.0005 secs
  25%% in 0.0011 secs
  50%% in 0.0039 secs
  75%% in 0.0236 secs
  90%% in 0.0478 secs
  95%% in 0.0717 secs
  99%% in 0.1183 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0001 secs, 0.0000 secs, 0.0346 secs
  DNS-lookup:	0.0001 secs, 0.0000 secs, 0.0389 secs
  req write:	0.0004 secs, 0.0000 secs, 0.0548 secs
  resp wait:	0.0099 secs, 0.0001 secs, 0.0730 secs
  resp read:	0.0044 secs, 0.0000 secs, 0.0754 secs

Status code distribution:
  [200]	60 responses
  [429]	940 responses