load-test-results/hey-cached-20260425-140131.txt

Summary:
  Total:	0.0566 secs
  Slowest:	0.0513 secs
  Fastest:	0.0001 secs
  Average:	0.0024 secs
  Requests/sec:	17673.4063
  
  Total data:	69260 bytes
  Size/request:	69 bytes

Response time histogram:
  0.000 [1]	|
  0.005 [846]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.010 [129]	|■■■■■■
  0.015 [20]	|■
  0.021 [0]	|
  0.026 [0]	|
  0.031 [0]	|
  0.036 [0]	|
  0.041 [0]	|
  0.046 [0]	|
  0.051 [4]	|


Latency distribution:
  10%% in 0.0001 secs
  25%% in 0.0003 secs
  50%% in 0.0011 secs
  75%% in 0.0036 secs
  90%% in 0.0064 secs
  95%% in 0.0085 secs
  99%% in 0.0138 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0017 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0017 secs
  req write:	0.0002 secs, 0.0000 secs, 0.0064 secs
  resp wait:	0.0014 secs, 0.0000 secs, 0.0484 secs
  resp read:	0.0006 secs, 0.0000 secs, 0.0074 secs

Status code distribution:
  [200]	60 responses
  [429]	940 responses