load-test-results/hey-cached-20260425-140334.txt

Summary:
  Total:	0.0326 secs
  Slowest:	0.0070 secs
  Fastest:	0.0000 secs
  Average:	0.0014 secs
  Requests/sec:	30655.0929
  
  Total data:	69260 bytes
  Size/request:	69 bytes

Response time histogram:
  0.000 [1]	|
  0.001 [374]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.001 [215]	|■■■■■■■■■■■■■■■■■■■■■■■
  0.002 [169]	|■■■■■■■■■■■■■■■■■■
  0.003 [93]	|■■■■■■■■■■
  0.004 [74]	|■■■■■■■■
  0.004 [42]	|■■■■
  0.005 [26]	|■■■
  0.006 [3]	|
  0.006 [2]	|
  0.007 [1]	|


Latency distribution:
  10%% in 0.0001 secs
  25%% in 0.0004 secs
  50%% in 0.0011 secs
  75%% in 0.0021 secs
  90%% in 0.0033 secs
  95%% in 0.0039 secs
  99%% in 0.0047 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0015 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0013 secs
  req write:	0.0001 secs, 0.0000 secs, 0.0035 secs
  resp wait:	0.0004 secs, 0.0000 secs, 0.0032 secs
  resp read:	0.0006 secs, 0.0000 secs, 0.0044 secs

Status code distribution:
  [200]	60 responses
  [429]	940 responses