load-test-results/vegeta-100-20260425-140131.txt
Requests      [total, rate, throughput]         6000, 100.02, 0.13
Duration      [total, attack, wait]             59.991s, 59.991s, 298.249µs
Latencies     [min, mean, 50, 90, 95, 99, max]  106.338µs, 275.134µs, 250.042µs, 372.268µs, 408.991µs, 516.39µs, 15.379ms
Bytes In      [total, mean]                     29382, 4.90
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           0.13%
Status Codes  [code:count]                      0:5438  200:8  429:554  
Error Set:
429 Too Many Requests
Get "http://localhost:8082/api/v1/check?d=example.com": dial tcp 0.0.0.0:0->127.0.0.1:8082: connect: connection refused