load-test-results/vegeta-100-20260425-140334.txt
Requests      [total, rate, throughput]         6000, 100.02, 0.12
Duration      [total, attack, wait]             59.991s, 59.99s, 219.517µs
Latencies     [min, mean, 50, 90, 95, 99, max]  82.167µs, 195.524µs, 189.364µs, 258.55µs, 300.398µs, 351.951µs, 783.212µs
Bytes In      [total, mean]                     26708, 4.45
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           0.12%
Status Codes  [code:count]                      0:5487  200:7  429:506  
Error Set:
429 Too Many Requests
Get "http://localhost:8080/api/v1/check?d=example.com": dial tcp 0.0.0.0:0->127.0.0.1:8080: connect: connection refused