load-test-results/vegeta-cached-20260425-131320.txt
Requests      [total, rate, throughput]         1000, 200.19, 3.80
Duration      [total, attack, wait]             4.996s, 4.995s, 482.924µs
Latencies     [min, mean, 50, 90, 95, 99, max]  173.643µs, 922.246µs, 527.808µs, 1.852ms, 3.34ms, 6.781ms, 19.114ms
Bytes In      [total, mean]                     54068, 54.07
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           1.90%
Status Codes  [code:count]                      200:19  429:981  
Error Set:
429 Too Many Requests