load-test-results/vegeta-cached-20260425-133913.txt
Requests      [total, rate, throughput]         1000, 200.18, 0.80
Duration      [total, attack, wait]             4.996s, 4.995s, 375.45µs
Latencies     [min, mean, 50, 90, 95, 99, max]  224.205µs, 367.854µs, 362.141µs, 436.818µs, 466.269µs, 531.81µs, 1.154ms
Bytes In      [total, mean]                     48488, 48.49
Bytes Out     [total, mean]                     0, 0.00
Success       [ratio]                           0.40%
Status Codes  [code:count]                      200:4  429:996  
Error Set:
429 Too Many Requests